Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.GetOptions Method (ClashCheckOptions)
 Returns the value of the clash check options.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool GetOptions(
	ref ClashCheckOptions Options
)
Public Shared Function GetOptions (
	ByRef Options As ClashCheckOptions
) As Boolean
Parameters
Options
Type: Tekla.Structures.ClashCheckOptions
The returned value of the clash check options.
Return Value
Type: Boolean
True if the values were successfully retrieved.
See Also
Reference
TeklaStructuresSettings Class
GetOptions Overload
Tekla.Structures Namespace